airport-logger/airport-final/app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
	def index
		@airplanes = Airplane.all

INSERT INTO "airplanes" ("code", "seat_capacity", "destination", "time_in", "time_out", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@airplane = Airplane.new(airplane_params)

		if @airplane.save

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@airplane = Airplane.find(params[:id])

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@airplane = Airplane.find(params[:id])

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "airplanes" SET "code" = ?, "destination" = ?, "updated_at" = ? WHERE "airplanes"."id" = ?  [["code", "2"], ["destination", "Switzerland"], ["updated_at", "2019-07-15 06:35:39.993452"], ["id", 1]]
---
	def update
		@airplane = Airplane.find(params[:id])

		if @airplane.update(airplane_params)

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "airplanes" WHERE "airplanes"."id" = ?  [["id", 1]]
---
	def destroy
		@airplane = Airplane.find(params[:id])
		@airplane.destroy